package game

const greeting_eng = `
----------------------------------------------------------------------------------------------------
     _______  _____   _____          _______             _____          _______   ____   ______
    |__   __||_   _| / ____|        |__   __|    /\     / ____|        |__   __| / __ \ |  ____|
       | |     | |  | |      ______    | |      /  \   | |      ______    | |   | |  | || |__
       | |     | |  | |     |______|   | |     / /\ \  | |     |______|   | |   | |  | ||  __|
       | |    _| |_ | |____            | |    / ____ \ | |____            | |   | |__| || |____
       |_|   |_____| \_____|           |_|   /_/    \_\ \_____|           |_|    \____/ |______|

----------------------------------------------------------------------------------------------------
`

const greeting_rus = `
-----------------------------------------------------------------------------------------------------
 _  __ ____   ____   ___  _____  _   _  _  __ _   _       _   _   ___             _   _  _  __ _   _ 
| |/ /|  _ \ |  __| / __||_   _|| | | || |/ /| | | |     | | | | / _ \     /\    | | | || |/ /| | | |
| ' / | |_) || |_  | |     | |  | |/  || | / | |/  |  __ | |_| || | | |   /  \   | |/  || | / | |/  |
|  <  |  __/ |  _| | |     | |  |  /| ||  <  |  /| | |__||  _  || | | |  / /\ \  |  /| ||  <  |  /| |
| . \ | |    | |__ | |__   | |  | | | || | \ | | | |     | | | || |_| | / /  \ \ | | | || | \ | | | |
|_|\_\|_|    |____| \___|  |_|  |_| |_||_|\_\|_| |_|     |_| |_| \___/ /_/    \_\|_| |_||_|\_\|_| |_|

-----------------------------------------------------------------------------------------------------
`

const rules_eng = `
Use y and x coordinates for the game. y and x are vertical and horizontal coordinates, respectively.
Cell coordinates:			           Example:
                			Enter y and x, please: 1 1
   1 1|1 2|1 3  			   |   |               X |   |   
   -----------  			-----------           -----------
   2 1|2 2|2 3  			   |   |       ===>      |   |   
   -----------  			-----------           -----------
   3 1|2 3|3 3  			   |   |                 |   |

----------------------------------------------------------------------------------------------------
`

const rules_rus = `
Используйте координаты y и x. y и x вертикальная и горизонтальная координаты, соответсвенно.
Координаты ячеек:			           Пример:
                			Пожалуйста, введите y и x: 1 1
   1 1|1 2|1 3  			   |   |               X |   |   
   -----------  			-----------           -----------
   2 1|2 2|2 3  			   |   |       ===>      |   |   
   -----------  			-----------           -----------
   3 1|2 3|3 3  			   |   |                 |   |

-----------------------------------------------------------------------------------------------------
`

const congratulation_eng = `
----------------------------------------------------------------------------------------------------
   ____   ___   _   _   ____  ____      _     _____  _   _  _        _    _____  ___   ___   _   _ 
  / ___| / _ \ | \ | | / ___||  _ \    / \   |_   _|| | | || |      / \  |_   _||_ _| / _ \ | \ | |
  | |    | | | |   | || |  _ | |_) |  / _ \    | |  | | | || |     / _ \   | |   | | | | | ||  \| |
  | |___ | | | | |\  || |_| ||  _ <  / ___ \   | |  | |_| || |__  / ___ \  | |   | | | |_| || |\  |
  \____| \___/ |_| \_| \____||_| \_\/_/   \_\  |_|   \___/ |____|/_/   \_\ |_|  |___| \___/ |_| \_|

----------------------------------------------------------------------------------------------------
`

const congratulation_rus = `
-----------------------------------------------------------------------------------------------------
                                  __     __  _____            
                                  \ \   / / |  __ \     /\    
                                   \ \_/ /  | |__) |   /  \   
                                    \ _ /   |  ___/   / /\ \  
                                  __/  /    | |      / ____ \ 
                                 |____/     |_|     /_/    \_\

-----------------------------------------------------------------------------------------------------
`

const menu_eng = `
						     Menu
						   1. Play
						   2. Exit
Select the menu item: `

const menu_rus = `
						     Меню
						   1. Играть
						   2. Выйти
Выберите нужный пункт меню: `

const inputPrompt_eng = "Enter y and x coordinates by space, please: "
const inputPrompt_rus = "Пожалуйста, введите y и x через пробел: "

const winMsg_eng = "won!"
const winMsg_rus = "победили!"

const сrosses_eng = "Сrosses"
const сrosses_rus = "Крестики"

const circles_eng = "Сircles"
const circles_rus = "Нолики"

const pressEnter_eng = "Press 'Enter', please."
const pressEnter_rus = "Нажмите 'Enter' пожалуйста."


// Errors
const invalidCoords_eng = "There is not a cell with these coordinats."
const busyCoords_eng    = "The cell with these coordinats is busy."
const noEnoughArgs_eng  = "Not enough arguments."
const tooManyArgs_eng   = "Too many arguments."
const useDigits_eng     = "Use digits, please."

const invalidCoords_rus = "Ячейки с такими координатами не существует."
const busyCoords_rus    = "Ячейка с такими координатами уже занята."
const noEnoughArgs_rus  = "Недостаточно параметров."
const tooManyArgs_rus   = "Слишком много параметров."
const useDigits_rus     = "Пожалуйста, используйте цифры."